phil971-psr.org
#+title: PHIL 971 - The Principle of Sufficient Reason 
#+date: July 8, 2022
#+author: Colin McLear

*** DONE Week 4 – Leibniz I: Truth, Explanation, & The PSR
    SCHEDULED: <2022-09-15 Thu>
   :PROPERTIES:
   :EXPORT_HUGO_TAGS:  explanation idealism leibniz psr truth 
   :EXPORT_FILE_NAME: week4
   :END:

This week we discuss Leibniz's theory of truth and ways in which it relates to his conception of substance, the principle of sufficient reason, and explanation. 

- [[https://discord.com/channels/1006739669842673674/1018167533599215636][Discussion thread]]
- [[id:20220914T135107.188323][Notes]] ([[file:static/materials/handouts/leibniz-substance.pdf][PDF]])
- [[file:static/materials/handouts/week-4-handout.pdf][Handout]]

**** Readings

- Leibniz:
   + "Meditations on Knowledge, Truth, and Ideas"
   + "First Truths"
   + /Discourse on Metaphysics/, §§1–13
   + /New Essays Concerning Human Understanding/, Preface (pp. 304-5, on Locke & superaddition)
   + "Monadology", §§31-60
   + Excerpts from the /Letters to Clarke/

- You can download these readings [[https://www.dropbox.com/sh/bo8w2wrslqq1bfa/AACdBUR7kpAQTgCgG27SDB9ha?dl=0][here]].

**** Recommended
Recommended readings below. I especially encourage you to read the objections from Hume. You can download the whole set of readings [[https://www.dropbox.com/sh/qddr4i38lbun1fh/AAAwUr1uAp05cS6tO_ZlCfmsa?dl=0][here]]. 

- Hume:
   + /Dialogues Concerning Natural Religion/, §9
   + /Enquiry Concerning Human understanding/, §4, part I
- Della Rocca: “Violations of the Principle of Sufficient Reason (in Leibniz and Spinoza)”
- Jolley, "The Metaphysics of Substances: Unity and Activity"
- Rutherford,
   + "The Categories of Thought and Being"
   + "Substance"

