content/assignments/week4.md
+++
title = "Week 4 – Leibniz I: Truth, Explanation, & The PSR"
publishDate = 2022-09-15T00:00:00-04:00
tags = ["explanation", "idealism", "leibniz", "psr", "truth"]
draft = false
weight = -100
author = false
toc = false
type = "post"
+++

This week we discuss Leibniz&rsquo;s theory of truth and ways in which it relates to his conception of substance, the principle of sufficient reason, and explanation.

-   [Discussion thread](https://discord.com/channels/1006739669842673674/1018167533599215636)
-   [Notes]({{< relref "leibniz-substance" >}}) ([PDF](/materials/handouts/leibniz-substance.pdf))


## Readings {#readings}

-   Leibniz:
    -   &ldquo;Meditations on Knowledge, Truth, and Ideas&rdquo;
    -   &ldquo;First Truths&rdquo;
    -   _Discourse on Metaphysics_, §§1–13
    -   _New Essays Concerning Human Understanding_, Preface (pp. 304-5, on Locke &amp; superaddition)
    -   &ldquo;Monadology&rdquo;, §§31-60
    -   Excerpts from the _Letters to Clarke_

-   You can download these readings [here](https://www.dropbox.com/sh/bo8w2wrslqq1bfa/AACdBUR7kpAQTgCgG27SDB9ha?dl=0).


## Recommended {#recommended}

Recommended readings below. I especially encourage you to read the objections from Hume. You can download the whole set of readings [here](https://www.dropbox.com/sh/qddr4i38lbun1fh/AAAwUr1uAp05cS6tO_ZlCfmsa?dl=0).

-   Hume:
    -   _Dialogues Concerning Natural Religion_, §9
    -   _Enquiry Concerning Human understanding_, §4, part I
-   Della Rocca: “Violations of the Principle of Sufficient Reason (in Leibniz and Spinoza)”
-   Jolley, &ldquo;The Metaphysics of Substances: Unity and Activity&rdquo;
-   Rutherford,
    -   &ldquo;The Categories of Thought and Being&rdquo;
    -   &ldquo;Substance&rdquo;
